package home_work_19.Task2;

/*
Task 2
Создайте класс для описания товара в чеке. В классе храните int id (артикул), название товара и
BigDecimal цену одной единицы товара.
В классе Application создайте список товаров (как в корзине в магазине), добавьте в него товары,
причем некоторые товары добавьте
по несколько раз.
Напишите метод, который принимает на вход этот список, и выводит в консоль чек: товар - количество и в
конце суммарную стоимость всех товаров в чеке.
каждого сайта

 */

public class BigDecimal {

}
