package home_work_8;


/*Создать класс Person с полями Имя, фамилия, год рождения, пол (два варианта - мужской и женский),
        семейный статус (singe/married). Используйте знания с лекции 8 при дизайне.

        Создайте класс, в котором создайте объект класса Pesron. Если человек старше 18 и single,
        предложите ему услуги своего сайта знакомств:
        "Уважаемый Павел, желаете ли познакомится с девушкой?" или "Уважаемая Светлана, мы поможем
        вам найти мужчину мечты!"

        Создайте еще один класс, в котором создайте массив Person, и сделайте для них все то же самое.
*/




      public enum PersonArray {
          ;

          String main(String[] args) {
              Personwihtenum person = new Personwihtenum("Dima", "Nowak", 22 - 11 - 1990, "Male", "single");
               return person.getFamilyStatus();

               Personwihtenum Personwihtenum = person.getFamilyStatus();
              if (this.equals(person));
              System.out.println("Are you 18 years and you single?"  person.equals(PersonFamalyStatus));
          }
      }




